# Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление. 
# Функцию hex используйте для проверки своего результата.

a = int(input("Введите целое число: "))
res = hex(a)
print(res)
